Revit 2024 API
GenericZone Class
 Provides access to the GenericZone Element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public class GenericZone : Element
Visual Basic
Public Class GenericZone _
	Inherits Element
Visual C++
public ref class GenericZone : public Element
Remarks
 A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object. A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis. A generic zone will contain specific domain requirements provided at creation of the element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.GenericZone
See Also
GenericZone Members
Autodesk.Revit.DB.Analysis Namespace